Австралия/src/InformationRegisters/NumberingSettings/NumberingSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>NumberingSettings</name>
  <resources>
    <name>Numerator</name>
    <type>
      <types>CatalogRef.Numerators</types>
    </type>
  </resources>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Presentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>DocumentType</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>OperationType</name>
    <type>
      <types>EnumRef.OperationTypesGoodsIssue</types>
      <types>EnumRef.OperationTypesDebitNote</types>
      <types>EnumRef.OperationTypesSupplierInvoice</types>
      <types>EnumRef.OperationTypesTaxInvoiceReceived</types>
      <types>EnumRef.OperationTypesPurchaseOrder</types>
      <types>EnumRef.OperationTypesOnlinePayment</types>
      <types>EnumRef.OperationTypesPaymentExpense</types>
      <types>EnumRef.OperationTypesPaymentReceipt</types>
      <types>EnumRef.OperationTypesGoodsReceipt</types>
      <types>EnumRef.OperationTypesEmployeeTask</types>
      <types>EnumRef.OperationTypesCashReceipt</types>
      <types>EnumRef.OperationTypesSalesInvoice</types>
      <types>EnumRef.OperationTypesInventoryTransfer</types>
      <types>EnumRef.OperationTypesSalesOrder</types>
      <types>EnumRef.OperationTypesTaxAccrual</types>
      <types>EnumRef.OperationTypesProduction</types>
      <types>EnumRef.OperationTypesCustomsDeclaration</types>
      <types>EnumRef.OperationTypesTransferAndPromotion</types>
      <types>EnumRef.OperationTypesTransferOrder</types>
      <types>EnumRef.OperationTypesPayrollSheet</types>
      <types>EnumRef.OperationTypesCashVoucher</types>
      <types>EnumRef.OperationTypesOnlineReceipt</types>
      <types>EnumRef.OperationTypesGoodsReturn</types>
      <types>EnumRef.OperationTypesIntraWarehouseTransfer</types>
      <types>EnumRef.OperationTypesArApAdjustments</types>
      <types>EnumRef.OperationTypesProductionOrder</types>
      <types>EnumRef.LoanAccrualTypes</types>
      <types>EnumRef.OperationTypesKitOrder</types>
      <types>EnumRef.OperationTypesAdditionalExpenses</types>
      <types>EnumRef.OperationTypesTaxInvoiceIssued</types>
      <types>EnumRef.OperationTypesCreditNote</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/NumberingSettings/Forms/ListForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("FilterValue") And ValueIsFilled(Parameters.FilterValue) Then 
		Dimensions = Metadata.InformationRegisters.NumberingSettings.Dimensions;
		For Each Dimension In Dimensions Do
			If Dimension.Type.ContainsType(TypeOf(Parameters.FilterValue)) Then
				ValuesArray = New Array;
				ValuesArray.Add(Parameters.FilterValue);
				ValuesArray.Add(Common.ObjectManagerByRef(Parameters.FilterValue).EmptyRef());
				CommonClientServer.SetFilterItem(List.Filter,
					Dimension.Name,
					ValuesArray);
				Break;
			EndIf;
		EndDo;
		Items.List.ChangeRowSet = False;
		Items.List.ReadOnly = True;
	EndIf;
	
	SetConditionalAppearance();
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersList

&AtClient
Procedure ListOnActivateRow(Item)
	
	If Items.List.CurrentData = Undefined Then
		Return;
	EndIf; 
	
	AttachIdleHandler("UpdateDataHandler", 0.2, True);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetConditionalAppearance()
	
	TextAll = TextAll();
	
	Fields = New Array;
	Fields.Add("OperationType");
	Fields.Add("Company");
	Fields.Add("BusinessUnit");
	Fields.Add("Counterparty");
	
	For Each Field In Fields Do
		
		Item = ConditionalAppearance.Items.Add();
		
		Item.Appearance.SetParameterValue("TextColor", StyleColors.InaccessibleDataColor);
		Item.Appearance.SetParameterValue("Text", TextAll);
		
		FilterItem = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
		FilterItem.LeftValue = New DataCompositionField("List." + Field);
		FilterItem.ComparisonType = DataCompositionComparisonType.NotFilled;
		
		FieldsItem = Item.Fields.Items.Add();
		FieldsItem.Field = New DataCompositionField(Field);
		
	EndDo;
	
EndProcedure

&AtClient
Procedure UpdateDataHandler()
	
	CurrentData = Items.List.CurrentData;
	
	TextAll = TextAll();
	
	If ValueIsFilled(CurrentData.OperationType) Then 
		OperationType = CurrentData.OperationType;
	Else 
		OperationType = TextAll;
	EndIf;
	
	If ValueIsFilled(CurrentData.Company) Then 
		Company = CurrentData.Company;
	Else 
		Company = TextAll;
	EndIf;
	
	If ValueIsFilled(CurrentData.BusinessUnit) Then 
		BusinessUnit = CurrentData.BusinessUnit;
	Else 
		BusinessUnit = TextAll;
	EndIf;
	
	If ValueIsFilled(CurrentData.Counterparty) Then 
		Counterparty = CurrentData.Counterparty;
	Else 
		Counterparty = TextAll;
	EndIf;
	
EndProcedure

&AtClientAtServerNoContext
Function TextAll()
	
	Return NStr("en = '<all>'; ru = '<все>';pl = '<wszystkie>';es_ES = '<todo>';es_CO = '<all>';tr = '<tümü>';it = '<tutto>';de = '<alle>'");
	
EndFunction

#EndRegion
